Revit 2027 API
IModuleMaker.Execute Method
 The method that Revit will invoke to create module project. When implementing this interface, programmer is responsible for making it exception-free
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Execute(
	string folder
)
Sub Execute (
	folder As String
)
void Execute(
	String^ folder
)
abstract Execute :
        folder : string -> unit
Parameters
folder String
 Module project folder.
See Also
Reference
IModuleMaker Interface
Autodesk.Revit.DB.Macros Namespace